{
  "title": "My Blog",
  "description": "JSON-driven blog on GitHub Pages",
  "author": "Matt Daly",
  "posts": [
    {
      "slug": "hackers-in-the-bazaar-reflection",
      "title": "Reading 01 Reflection – Hackers in the Bazaar",
      "date": "2025-08-31",
      "tags": [
        "reading",
        "reflection",
        "history"
      ],
      "summary": "Reflection on early MIT hacker culture from TX-0, PDP-1, and the hacker ethic.",
      "content_html": "\n<h2>Reading 01 Reflection – Hackers in the Bazaar - 8/31/2025</h2>\n\n<p>This first part of <em>Hackers in the Bazaar</em> presented an inside look into the emerging hacker culture at MIT in the 50s–60s, looking into their social lives, the kind of technology they were building, and the larger implications to this movement.</p>\n\n<figure>\n  <img src=\"tx-0.jpg\" alt=\"Users working on a TX-0 computer\">\n  <figcaption style=\"color:#9aa3af; font-size:0.9em; text-align:center; margin-top:6px;\">\n    Users working on a TX-0 computer\n  </figcaption>\n</figure>\n\n<p>In the late 50s, computers were only just starting to appear on college campuses, with MIT being one of the first. At this time, computers were still “Hulking Giant” machines, taking up entire floors of buildings. Users would write programs in machine code by hand, punch them into cards, then hand them over to a team of dedicated computer operators, who would run programs in batches and then return the output at some later point. Users would not have the option to debug errors live, as computer time was scarce, and machines were often highly protected due to their cost.</p>\n\n<p>At MIT the origin of the hacker culture began with the TX-0 and PDP-1, early minicomputers either donated or procured by the institute. With these minicomputers, as opposed to the Hulking Giants, students were given unprecedented access to the actual machine. Among the group of students who gravitated towards the computers were a group of especially dedicated young engineers who subscribed to a revolutionary new set of ideas, known as the hacker ethic.</p>\n\n<p>The early hackers believed that the only way to understand something was to work with it hands on, and to learn exactly how it functioned. Additionally, to the hackers, producing actual results (whether a new version of <em>Spacewar!</em> or a compiler for LISP) was what really mattered, not characteristics like race, appearance, or social skills. Information, like source code, should be freely available to all, not locked behind any barriers. Finally, authority should be disobeyed whenever it got in the way of access to technology.</p>\n\n<figure>\n  <img src=\"Spacewar!-PDP-1-20070512.jpg\" alt=\"Spacewar! on the PDP-1\">\n  <figcaption style=\"color:#9aa3af; font-size:0.9em; text-align:center; margin-top:6px;\">\n    Spacewar! on the PDP-1\n  </figcaption>\n</figure>\n\n<p>These new ideas were a whole new way of looking at the world, spurred by the new computers and the mindsets of the hackers who gravitated to them. They contrasted greatly with the bureaucratic routine of academia, especially at elite institutions. Though the hacker group at MIT was filled with technical geniuses who were building things even the military and IBM likely did not yet have, many failed out of college. They adopted a 30 hour work day, maximizing flow state time on the PC, often at the expense of their classes. Yet this did not deter the hackers, who felt the only important thing in the world was to create new innovations on the PC (called “Hacks”) and showcase them to their hacker peers.</p>\n\n<p>The hacker culture at MIT is romanticized – a group of young kids delving into an unknown realm and creating such cool hacks as sci-fi games, telephone exploits, and the first programming languages. These shy and socially inept kids were able to find their power through the computer, and also build a community of like minded people. In reality this lifestyle worked for some for a little while, but also was simply unhealthy in the long run, and several of the MIT golden age hackers attempted suicide. This group made tremendous progress both in building new computer innovations, and also setting up the culture for digital freedom and cooperation that constitutes the hacker ethic. Yet in doing so they lived obsessive, asocial lives which often (and during a Vietnam Protest against the MIT lab even literally) barricaded themselves off from greater society in the process.</p>\n\n<p>Before reading this section, I had some idea of the origin of hackers, being the first master programmers. I was not however, aware of the true origins behind the culture, with the Tech Model Railroad Club at MIT. Also, the whole thing was so much more extreme than I would have anticipated. True hackers were doing 30 hour work days to grind out code, and even sleeping in cots at the computer lab – or even in the ceiling above it – jumping on the machine whenever someone scheduled to use it did not show up.</p>\n\n<p>To me, this hacker ethic is inspiring. It shows how people who may be outcasts among the greater public can find purpose and fit in. It also is somewhat scary, as I realize that to ever achieve the mastery of these elite hackers, a similar absolute devotion to hacking would be required. The great hackers like Greenblatt, Gosper, Samson, Kotok, Russell, and Nelson are to be admired, and their names should forever be part of the computer science origin story. Yet I would be cautious to mimic their lives exactly, seeing the extremes that they went during this golden age.</p>\n"
    }
  ]
}

